app/Controllers/Api.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`usuario` = 'apiservice'
AND `usuarios`.`estado` = 1
 LIMIT 1
---
    public function validarDatos(){
        $auth = $this->autenticarLlave();
        if (!$auth['status']) {
            return $this->fail($auth['message'], $auth['code']);
        }

        try {
            $inputs = (array) $this->request->getVar();
            log_message('debug', 'DATOS PARA SESION APP: '.json_encode($inputs));

            $usuario = !empty($inputs['usuario']) ? $inputs['usuario'] : null;
            $pass = !empty($inputs['pass']) ? $inputs['pass'] : null;

            if(!$usuario || !$pass){
                return $this->fail('Usuario y contraseña son obligatorios', 400);
            }

            // Buscar usuario activo
            $user = $this->usuariosModel
                            ->where('usuarios.usuario', $usuario)
                            ->where('usuarios.estado', 1)
                            ->first();

SELECT `items`.`id`, `items`.`nombre`, `items`.`descripcion`, `items`.`duracion`, `items`.`precio`, `items`.`estado`
FROM `items`
WHERE `idTipo` = 2
AND `idEmpresa` = 1
---
    public function servicios(){
        $validacion = $this->autenticarToken();

        if(empty($validacion)) return $this->fail('Ocurrio un error al tratar de validar las credenciales');

        try{
            $inputs = (array) $this->request->getVar();

            $idEmpresa = !empty($inputs['idEmpresa']) ? $inputs['idEmpresa'] : NULL;
            if(empty($idEmpresa)) return $this->fail('Se debe enviar el idEmpresa.');

            // Primero obtenemos los usuarios válidos
            $servicios = $this->itemsModel
                             ->select('
                                items.id,
                                items.nombre,
                                items.descripcion,
                                items.duracion,
                                items.precio,
                                items.estado
                             ')
                             ->where('idTipo', 2)
                             ->where('idEmpresa', $idEmpresa)
                             ->findAll();

SELECT `empresas`.`id`, `empresas`.`nombre`, `empresas`.`email_contacto`, `empresas`.`descripcionNegocio`, `r`.`descripcion` AS `rubro`, `empresas`.`activa` AS `estado`, `empresas`.`direccion`, `empresas`.`latitud`, `empresas`.`longitud`, `empresas`.`ruc`
FROM `empresas`
JOIN `numeros_whatsapp` `nw` ON `nw`.`idEmpresa` = `empresas`.`id`
JOIN `rubros` `r` ON `r`.`id` = `empresas`.`idRubro`
WHERE `nw`.`telefono` = '595973935191'
 LIMIT 1
---
    public function datosEmpresa(){
        $validacion = $this->autenticarToken();

        if(empty($validacion)) return $this->fail('Ocurrio un error al tratar de validar las credenciales');

        try{
            $inputs = (array) $this->request->getVar();
            $telefono = !empty($inputs['telefono']) ? $inputs['telefono'] : NULL;

            if(empty($telefono)) return $this->fail('Faltan datos para consultar los datos de la empresa.');

            // Primero obtenemos los usuarios válidos
            $datosEmpresa = $this->empresasModel
                             ->select('
                                empresas.id,
                                empresas.nombre,
                                empresas.email_contacto,
                                empresas.descripcionNegocio,
                                r.descripcion AS rubro,
                                empresas.activa AS estado,
                                empresas.direccion,
                                empresas.latitud,
                                empresas.longitud,
                                empresas.ruc,
                                empresas.reglasBasicas,
                                empresas.reglasRestrictivas
                             ')
                             ->join('numeros_whatsapp nw', 'nw.idEmpresa = empresas.id')
                             ->join('rubros r', 'r.id = empresas.idRubro')
                             ->where('nw.telefono', $telefono)
                             ->first();

SELECT `empresas_datos_bancarios`.`id`, `b`.`descripcion`, `empresas_datos_bancarios`.`numeroCuenta`
FROM `empresas_datos_bancarios`
JOIN `bancos` AS `b` ON `b`.`id`=`empresas_datos_bancarios`.`idBanco`
WHERE `idEmpresa` = '1'
AND `empresas_datos_bancarios`.`estado` = 1
---

            $idEmpresa = $datosEmpresa['id'];

            $datosBancariosEmpresa = $this->empresasDatosBancariosModel
                                         ->select('
                                           empresas_datos_bancarios.id,
                                           b.descripcion,
                                           empresas_datos_bancarios.numeroCuenta
                                         ')
                                         ->join('bancos AS b', 'b.id=empresas_datos_bancarios.idBanco')
                                         ->where('idEmpresa', $idEmpresa)
                                         ->where('empresas_datos_bancarios.estado', 1)
                                         ->findAll();

SELECT `agendaDisponible`.`id`, `agendaDisponible`.`idItem`, `i`.`nombre` AS `servicio`, `agendaDisponible`.`fecha`, `agendaDisponible`.`horaInicio`, `agendaDisponible`.`horaFin`
FROM `agendaDisponible`
JOIN `items` `i` ON `i`.`id` = `agendaDisponible`.`idItem`
WHERE `agendaDisponible`.`estado` = 1
AND `i`.`idEmpresa` = 1
AND   (
`agendaDisponible`.`fecha` > '2025-10-28'
OR    (
`agendaDisponible`.`fecha` = '2025-10-28'
AND `agendaDisponible`.`horaInicio` >= '15:40:39'
  )
 )
AND `agendaDisponible`.`idItem` = 19
ORDER BY `agendaDisponible`.`fecha` ASC, `agendaDisponible`.`horaInicio` ASC
---
    public function agendaDisponible()
    {
        $validacion = $this->autenticarToken();
        if (empty($validacion)) return $this->fail('Error al validar token de acceso');

        try {
            $inputs = (array) $this->request->getVar();

            $fecha   = !empty($inputs['fecha']) ? $inputs['fecha'] : null;
            $hora    = !empty($inputs['hora']) ? $inputs['hora'] : null;
            $idItem  = !empty($inputs['idItem']) ? $inputs['idItem'] : null;
            $idEmpresa = !empty($inputs['idEmpresa']) ? $inputs['idEmpresa'] : null;

            if(empty($idEmpresa)) return $this->fail('Enviar el identificador de empresa. Falta [idEmpresa].');

            // Fecha y hora actual
            $fechaActual = date('Y-m-d');
            $horaActual  = date('H:i:s');

            $query = $this->agendaDisponibleModel
                ->select('
                    agendaDisponible.id,
                    agendaDisponible.idItem,
                    i.nombre AS servicio,
                    agendaDisponible.fecha,
                    agendaDisponible.horaInicio,
                    agendaDisponible.horaFin
                ')
                ->join('items i', 'i.id = agendaDisponible.idItem')
                ->where('agendaDisponible.estado', 1)
                ->where('i.idEmpresa', $idEmpresa);

SELECT `idAgendaDisponible`
FROM `agendamiento`
WHERE `id` = 6
 LIMIT 1
---
                        ->update();

                    // 1️⃣ Obtener fecha y hora reales
                    $agendaInfo = $this->agendamientoModel
                        ->select('idAgendaDisponible')
                        ->where('id', $idAgendamiento)
                        ->first();

UPDATE `agendaDisponible` SET `estado` = 1
WHERE `id` = '10'
---
                        log_message('debug', 'No se encontro horario para actualizar estado.');
                    }else{
                        $idAgendaDisponible = $agendaInfo['idAgendaDisponible'];
                        $this->agendaDisponibleModel
                             ->where('id', $idAgendaDisponible)
                             ->set(['estado' => 1])
                             ->update();